[
    {
        "id": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "../src/assets/images/book1.png",
        "review": "Harper Lee’s 'To Kill a Mockingbird' is a timeless classic that delves into the complexities of racial injustice and moral growth in the American South during the 1930s. Through the innocent eyes of Scout Finch, the daughter of lawyer Atticus Finch, readers are confronted with the harsh realities of bigotry and prejudice as Atticus defends a black man falsely accused of raping a white woman. Lee’s narrative not only explores the legal system and social norms of the era but also offers profound insights into empathy, compassion, and the human condition. With its rich character development and compelling storytelling, 'To Kill a Mockingbird' remains a poignant and thought-provoking masterpiece.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Legal Drama",
            "Coming-of-Age"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "id": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "../src/assets/images/book2.png",
        "review": "George Orwell’s '1984' is a dystopian novel that serves as a chilling warning against the dangers of totalitarianism and the erosion of individual freedoms. Set in a totalitarian regime led by the omnipresent Big Brother, the story follows Winston Smith, a disillusioned bureaucrat who dares to rebel against the oppressive regime. Through Winston’s journey of defiance and rebellion, Orwell paints a bleak picture of a surveillance state where truth is manipulated, and dissent is ruthlessly suppressed. '1984' remains a powerful and thought-provoking exploration of surveillance, propaganda, and the fragility of truth, making it as relevant today as it was when it was first published.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Dystopian",
        "tags": [
            "Politics",
            "Social Commentary"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "id": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "../src/assets/images/book3.jpg",
        "review": "F. Scott Fitzgerald’s 'The Great Gatsby' is a masterpiece of American literature that explores the illusion of the American Dream and the decadence of the Jazz Age. Set in the 1920s, the novel follows the enigmatic Jay Gatsby, a wealthy socialite who is obsessed with the idea of reclaiming his lost love, Daisy Buchanan. Through the eyes of Nick Carraway, the narrator, readers are drawn into Gatsby’s world of extravagance, love, and tragedy. Fitzgerald’s lyrical prose and vivid imagery capture the spirit of the Roaring Twenties while also offering a profound critique of the empty pursuit of wealth and status. 'The Great Gatsby' remains a timeless classic that continues to resonate with readers today.",
        "totalPages": 180,
        "rating": 4.6,
        "category": "Classic",
        "tags": [
            "Fiction",
            "Romance",
            "Drama"
        ],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "id": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "../src/assets/images/book4.jpg",
        "review": "Jane Austen’s 'Pride and Prejudice' is a timeless romance novel that continues to captivate readers with its wit, charm, and social commentary. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the pitfalls of love, marriage, and social status. Central to the story is Elizabeth’s tumultuous relationship with the proud and enigmatic Mr. Darcy, whose initial disdain masks a deep admiration for her independent spirit. Through Austen’s keen observations of society and human nature, 'Pride and Prejudice' not only entertains but also offers timeless lessons about love, class, and the importance of overcoming prejudice.",
        "totalPages": 432,
        "rating": 4.9,
        "category": "Romance",
        "tags": [
            "Classic",
            "Regency Era"
        ],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "id": 5,
        "bookName": "Harry Potter and the Sorcerer's Stone",
        "author": "J.K. Rowling",
        "image": "../src/assets/images/book5.jpg",
        "review": "J.K. Rowling’s 'Harry Potter and the Sorcerer's Stone' is a magical journey into a world of wonder and enchantment. The story follows young Harry Potter as he discovers his true identity as a wizard and begins his education at Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron and Hermione, Harry embarks on a series of adventures that lead him to uncover the truth about his past and confront the dark wizard Voldemort. Filled with richly imagined characters, spellbinding magic, and themes of friendship and bravery, 'Harry Potter and the Sorcerer's Stone' is a modern classic that continues to inspire readers of all ages.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Children's Literature"
        ],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "id": 6,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "../src/assets/images/book6.jpg",
        "review": "J.D. Salinger’s 'The Catcher in the Rye' is a seminal coming-of-age novel that continues to resonate with readers for its honest portrayal of adolescent angst and alienation. The story follows Holden Caulfield, a disaffected teenager who embarks on a journey of self-discovery in New York City after being expelled from his prep school. Through Holden’s cynical yet vulnerable narration, Salinger explores themes of identity, alienation, and the search for authenticity in a world filled with phoniness. 'The Catcher in the Rye' remains a powerful and enduring classic that speaks to the universal experience of growing up and finding one’s place in the world.",
        "totalPages": 224,
        "rating": 4.7,
        "category": "Fiction",
        "tags": [
            "Bildungsroman",
            "American Literature"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "id": 7,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "../src/assets/images/book7.png",
        "review": "The Silent Patient by Alex Michaelides is a gripping psychological thriller that will keep you on the edge of your seat from start to finish. The story follows Alicia Berenson, a talented painter who seemingly has a perfect life until she shoots her husband and then stops speaking. Theo Faber, a psychotherapist, becomes obsessed with her case and is determined to unravel the mystery behind her silence. As Theo delves deeper into Alicia's past and psyche, he uncovers shocking truths that will leave you questioning everything you thought you knew. With its unpredictable twists and complex characters, The Silent Patient is a must-read for fans of the genre.",
        "totalPages": 336,
        "rating": 4.6,
        "category": "Thriller",
        "tags": [
            "Psychological",
            "Suspense"
        ],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "id": 8,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "../src/assets/images/book8.jpg",
        "review": "Educated by Tara Westover is a powerful memoir that chronicles the author's journey from growing up in a survivalist family in rural Idaho to eventually earning a PhD from Cambridge University. Westover's story is both inspiring and harrowing as she recounts her experiences of being denied a formal education for most of her life and the challenges she faced in breaking free from her family's oppressive beliefs. Through her resilience and determination, Westover triumphs over adversity and ultimately discovers the transformative power of education. This memoir is a testament to the importance of self-discovery and the pursuit of knowledge.",
        "totalPages": 352,
        "rating": 4.7,
        "category": "Memoir",
        "tags": [
            "Autobiography",
            "Inspiring"
        ],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "id": 9,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "../src/assets/images/book9.jpg",
        "review": "The Night Circus by Erin Morgenstern is a mesmerizing and enchanting novel that transports readers to a magical world filled with wonder and mystery. The story revolves around a mysterious circus that arrives without warning and is only open at night. As the circus travels the world, two young illusionists, Celia and Marco, engage in a fierce competition under the watchful eye of their enigmatic mentors. Their rivalry soon evolves into a passionate love affair, but they soon realize that their fate is intertwined with the circus itself. Morgenstern's lyrical prose and vivid imagery create an immersive reading experience that will captivate readers until the very end.",
        "totalPages": 400,
        "rating": 4.5,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Romance"
        ],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "id": 10,
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "image": "../src/assets/images/book10.png",
        "review": "The Girl on the Train by Paula Hawkins is a gripping psychological thriller that will keep you guessing until the very end. The story follows Rachel Watson, a troubled woman who becomes obsessed with a seemingly perfect couple she sees from the train every day. When the woman, Megan, goes missing, Rachel becomes entangled in the investigation and begins to uncover dark secrets that threaten to unravel her own life. Hawkins masterfully weaves together multiple perspectives and timelines, keeping readers on the edge of their seats with its twists and turns. If you're a fan of suspenseful thrillers with unreliable narrators, this book is a must-read.",
        "totalPages": 336,
        "rating": 4.2,
        "category": "Thriller",
        "tags": [
            "Mystery",
            "Suspense"
        ],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "id": 11,
        "bookName": "Becoming",
        "author": "Michelle Obama",
        "image": "../src/assets/images/book11.jpg",
        "review": "Becoming by Michelle Obama is an intimate and inspiring memoir that takes readers on a journey through the former First Lady's life. From her humble beginnings on the South Side of Chicago to her years in the White House, Obama shares candid reflections on her triumphs and challenges, as well as her role as a mother, wife, and advocate for social justice. Through her warmth and grace, Obama offers valuable insights into leadership, resilience, and the power of community. Whether you're a longtime admirer or new to her story, Becoming is a deeply personal and captivating read.",
        "totalPages": 448,
        "rating": 4.8,
        "category": "Memoir",
        "tags": [
            "Inspiring",
            "Leadership"
        ],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2018
    },
    {
        "id": 12,
        "bookName": "The Goldfinch",
        "author": "Donna Tartt",
        "image": "../src/assets/images/book12.jpg",
        "review": "The Goldfinch by Donna Tartt is a sprawling and ambitious novel that explores themes of art, love, and loss. The story follows Theo Decker, a young boy who survives a tragic terrorist attack at the Metropolitan Museum of Art that kills his mother. In the aftermath of the attack, Theo steals a valuable painting, The Goldfinch, which becomes both a burden and a lifeline for him as he navigates the complexities of adulthood. Tartt's prose is rich and evocative, drawing readers into Theo's world with its vivid characters and intricate plot. At its heart, The Goldfinch is a profound meditation on the search for meaning and identity in an unpredictable world.",
        "totalPages": 771,
        "rating": 4.3,
        "category": "Fiction",
        "tags": [
            "Art",
            "Coming-of-Age"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2013
    }
]